<a href="https://colab.research.google.com/github/trirex79/python/blob/main/Analiza_danych/dane_gieldowe_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Import bibliotek

In [1]:

import numpy as np
import pandas as pd

print(f'Numpy: {np.__version__}')
print(f'Pandas: {pd.__version__}')

Numpy: 1.19.5
Pandas: 1.1.5

# Ładowanie danych

In [2]:

def fetch_financial_data(company='AMZN'):
    """Pobiera dane dotyczące notowań spółek na giełdzie według symboli
    na serwisie stooq.pl"""
    import pandas_datareader.data as web
    return web.DataReader(name=company, data_source='stooq')

df = fetch_financial_data()
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1258 entries, 2021-07-30 to 2016-08-02
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    1258 non-null   float64
 1   High    1258 non-null   float64
 2   Low     1258 non-null   float64
 3   Close   1258 non-null   float64
 4   Volume  1258 non-null   int64
dtypes: float64(4), int64(1)
memory usage: 59.0 KB

In [3]:
df

               Open       High       Low    Close   Volume
Date
2021-07-30  3347.95  3368.1400  3306.980  3327.59  9965593
2021-07-29  3627.75  3637.9500  3580.010  3599.92  5519952
2021-07-28  3633.78  3658.4204  3601.000  3630.32  2999378
2021-07-27  3698.50  3698.5000  3586.150  3626.39  4131890
2021-07-26  3673.17  3712.0800  3647.250  3699.82  2900068
...             ...        ...       ...      ...      ...
2016-08-08   766.81   767.0000   761.015   766.56  1709639
2016-08-05   764.81   768.4700   763.090   765.98  2516246
2016-08-04   753.70   765.0000   750.350   760.77  2557512
2016-08-03   757.06   758.8900   752.250   754.55  3083438
2016-08-02   763.81   765.0100   757.020   760.58  3167836

[1258 rows x 5 columns]

In [4]:
df.head()

               Open       High      Low    Close   Volume
Date
2021-07-30  3347.95  3368.1400  3306.98  3327.59  9965593
2021-07-29  3627.75  3637.9500  3580.01  3599.92  5519952
2021-07-28  3633.78  3658.4204  3601.00  3630.32  2999378
2021-07-27  3698.50  3698.5000  3586.15  3626.39  4131890
2021-07-26  3673.17  3712.0800  3647.25  3699.82  2900068

In [5]:
df.tail()

              Open    High      Low   Close   Volume
Date
2016-08-08  766.81  767.00  761.015  766.56  1709639
2016-08-05  764.81  768.47  763.090  765.98  2516246
2016-08-04  753.70  765.00  750.350  760.77  2557512
2016-08-03  757.06  758.89  752.250  754.55  3083438
2016-08-02  763.81  765.01  757.020  760.58  3167836

In [6]:
df.head(3)

               Open       High      Low    Close   Volume
Date
2021-07-30  3347.95  3368.1400  3306.98  3327.59  9965593
2021-07-29  3627.75  3637.9500  3580.01  3599.92  5519952
2021-07-28  3633.78  3658.4204  3601.00  3630.32  2999378

In [7]:
df.columns

Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')

In [9]:
df.columns = [col.lower() for col in df.columns]
df.columns

Index(['open', 'high', 'low', 'close', 'volume'], dtype='object')

In [11]:
df.describe().T

         count          mean  ...           75%           max
open    1258.0  1.865338e+03  ...  2.372130e+03  3.744000e+03
high    1258.0  1.884496e+03  ...  2.405775e+03  3.773078e+03
low     1258.0  1.843615e+03  ...  2.341784e+03  3.696793e+03
close   1258.0  1.864638e+03  ...  2.374427e+03  3.731410e+03
volume  1258.0  4.276295e+06  ...  5.115194e+06  1.655260e+07

[5 rows x 8 columns]

In [14]:
df = df.head(100)
df

               open       high        low    close   volume
Date
2021-07-30  3347.95  3368.1400  3306.9800  3327.59  9965593
2021-07-29  3627.75  3637.9500  3580.0100  3599.92  5519952
2021-07-28  3633.78  3658.4204  3601.0000  3630.32  2999378
2021-07-27  3698.50  3698.5000  3586.1500  3626.39  4131890
2021-07-26  3673.17  3712.0800  3647.2500  3699.82  2900068
...             ...        ...        ...      ...      ...
2021-03-16  3104.97  3128.9100  3075.8601  3091.86  2538764
2021-03-15  3074.57  3082.2400  3032.0900  3081.68  2918592
2021-03-12  3075.00  3098.9800  3045.5000  3089.49  2421888
2021-03-11  3104.01  3131.7843  3082.9300  3113.59  2776391
2021-03-10  3098.45  3116.4600  3030.0500  3057.64  3012489

[100 rows x 5 columns]

##Wycinanie kolumn

In [16]:
df.open

Date
2021-07-30    3347.95
2021-07-29    3627.75
2021-07-28    3633.78
2021-07-27    3698.50
2021-07-26    3673.17
               ...
2021-03-16    3104.97
2021-03-15    3074.57
2021-03-12    3075.00
2021-03-11    3104.01
2021-03-10    3098.45
Name: open, Length: 100, dtype: float64

In [18]:
df[['open','close']]

               open    close
Date
2021-07-30  3347.95  3327.59
2021-07-29  3627.75  3599.92
2021-07-28  3633.78  3630.32
2021-07-27  3698.50  3626.39
2021-07-26  3673.17  3699.82
...             ...      ...
2021-03-16  3104.97  3091.86
2021-03-15  3074.57  3081.68
2021-03-12  3075.00  3089.49
2021-03-11  3104.01  3113.59
2021-03-10  3098.45  3057.64

[100 rows x 2 columns]

In [19]:
df.iloc[:,[0,3]]

               open    close
Date
2021-07-30  3347.95  3327.59
2021-07-29  3627.75  3599.92
2021-07-28  3633.78  3630.32
2021-07-27  3698.50  3626.39
2021-07-26  3673.17  3699.82
...             ...      ...
2021-03-16  3104.97  3091.86
2021-03-15  3074.57  3081.68
2021-03-12  3075.00  3089.49
2021-03-11  3104.01  3113.59
2021-03-10  3098.45  3057.64

[100 rows x 2 columns]

In [21]:
df.iloc[0:4,[0,3]]

               open    close
Date
2021-07-30  3347.95  3327.59
2021-07-29  3627.75  3599.92
2021-07-28  3633.78  3630.32
2021-07-27  3698.50  3626.39

In [22]:
df.iloc[:, -3:]

                  low    close   volume
Date
2021-07-30  3306.9800  3327.59  9965593
2021-07-29  3580.0100  3599.92  5519952
2021-07-28  3601.0000  3630.32  2999378
2021-07-27  3586.1500  3626.39  4131890
2021-07-26  3647.2500  3699.82  2900068
...               ...      ...      ...
2021-03-16  3075.8601  3091.86  2538764
2021-03-15  3032.0900  3081.68  2918592
2021-03-12  3045.5000  3089.49  2421888
2021-03-11  3082.9300  3113.59  2776391
2021-03-10  3030.0500  3057.64  3012489

[100 rows x 3 columns]

##Wycinanie wierszy

In [23]:
df.iloc[0]

open         3347.95
high         3368.14
low          3306.98
close        3327.59
volume    9965593.00
Name: 2021-07-30 00:00:00, dtype: float64

In [24]:
df.iloc[:3]

               open       high      low    close   volume
Date
2021-07-30  3347.95  3368.1400  3306.98  3327.59  9965593
2021-07-29  3627.75  3637.9500  3580.01  3599.92  5519952
2021-07-28  3633.78  3658.4204  3601.00  3630.32  2999378

In [25]:
df.loc['2021-07-29']

               open     high      low    close   volume
Date
2021-07-29  3627.75  3637.95  3580.01  3599.92  5519952

##Obliczanie nowych kolumn